---
kind: method
id: M:Autodesk.Revit.DB.ValueParsingOptions.Dispose
source: html/03a44256-4123-6916-bbf3-39013a3cf238.htm
---
# Autodesk.Revit.DB.ValueParsingOptions.Dispose Method

Releases all resources used by the ValueParsingOptions

## Syntax (C#)
```csharp
public void Dispose()
```